[{"id":0,"text":"You wake up near a small gasping fire. The cold night breathes on your neck from the entrance to the cave.","options":[{"text":"Get up.","next":1}]},{"id":1,"text":"The faint smell of rot and wet enters your nose as you peer into the cave. You turn back and peer out into an unending black night, seemingly darker than the cave.","options":[{"text":"Go into the cave.","next":2},{"text":"Go out into the night.","next":3}]},{"id":2,"text":"You grab a stick from the fire for a torch. \nYou walk into the cave, the odd stench growing stronger with each step. You hear a soft rythmic dripping sound coming from deeper in the cave.","options":[{"text":"Continue.","next":4}]},{"id":3,"text":"You walk out into the night. The cold air bites at your skin... \nYou feel a sharp pain in your neck and fall to the ground. The last thing you see is a pair of glowing eyes.","options":[{"text":"Continue.","next":999999}]},{"id":4,"text":"The rhythm of the splash grows louder as you inch closer. It seems so close now.\nYou look up to see a small crack in the ceiling. A pale cloudy water drips from it to the floor.","options":[{"text":"Continue.","next":5}]},{"id":5,"text":"You stumble your way around the unsightly puddle. You reach a fork in the tunnel.\nThere is a faint breeze coming from the left tunnel.\nYou notice a soft glow in the distance of the right tunnel.","options":[{"text":"Go left.","next":6},{"text":"Go right.","next":7}]},{"id":6,"text":"You walk patiently towards the breeze as it fades in and out.\nIt is much stronger now.\nYou raise your torch and see the massive nostrils of a troll.","options":[{"text":"Run.","next":8},{"text":"Attempt to slay him.","next":9}]},{"id":7,"text":"You feel more and more warm as you approach the light.\nSlowly you start to hear high pitch laughter creep into your ears from the direction of the light.","options":[{"text":"Turn back.","next":5},{"text":"Proceed to the light.","next":13}]},{"id":8,"text":"Overcome with fear you dash away from the massive beast.\nIn your haste your foot crashes into the cloudy puddle. It is far deeper than you expected. You crash to the floor.\n*BANG*","options":[{"text":"Continue.","next":10}]},{"id":10,"text":"You hear a deep growl come from behind...\nYou peek back as you rise to see the troll standing over you.","options":[{"text":"Run.","next":11},{"text":"Stand and fight!","next":12}]},{"id":11,"text":"You turn to escape as many have tried to do in the past.\nYou feel the trolls cold fingers wrap around your torso.\nWith one squeeze you near instantly go from crushing pain to totally numb.\nThe smell of his breath, the last sense you have as you are devoured.","options":[{"text":"Continue.","next":999999}]},{"id":12,"text":"On your left hip is your sword. On your right hip is a small flask. In your left hand your torch.\nWhat shall you use to fight the beast?","options":[{"text":"The sword!","next":99},{"text":"The torch!","next":98},{"text":"The flask!","next":0}]},{"id":13,"text":"You sneak closer to the light. Closer to the laughter...\nAs you approach the light, your eyes adjust. You see several small fairies dancing a round a flame. The flame is too bright to see exactly what, but something round burns in the flame.","options":[{"text":"Continue","next":14}]},{"id":999991,"text":"You have survived the night. \nYou win.","options":[]},{"id":999999,"text":"You have died.","options":[]}]